<a href="https://colab.research.google.com/github/danlig94/data_science/blob/master/Pandas/Pandas02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
pd.__version__

'1.0.5'

In [2]:
df = pd.DataFrame(data=[5,6,7,8,7,6,5])
df

   0
0  5
1  6
2  7
3  8
4  7
5  6
6  5

In [3]:
df = pd.DataFrame(data=[1,2,3], index=["First","Second", "Third"], columns=['col_1'])
df

        col_1
First       1
Second      2
Third       3

In [4]:
df = pd.DataFrame(data=[[1,2,3], [4,5,6], [7,8,9]], index=["first", "second", "third"], columns=["col_1", "col_2", "col_3"])
df

        col_1  col_2  col_3
first       1      2      3
second      4      5      6
third       7      8      9

In [5]:
df.columns

Index(['col_1', 'col_2', 'col_3'], dtype='object')

In [6]:
df.index

Index(['first', 'second', 'third'], dtype='object')

In [7]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, first to third
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col_1   3 non-null      int64
 1   col_2   3 non-null      int64
 2   col_3   3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [9]:
df.describe()

       col_1  col_2  col_3
count    3.0    3.0    3.0
mean     4.0    5.0    6.0
std      3.0    3.0    3.0
min      1.0    2.0    3.0
25%      2.5    3.5    4.5
50%      4.0    5.0    6.0
75%      5.5    6.5    7.5
max      7.0    8.0    9.0

In [10]:
df.describe().T

       count  mean  std  min  25%  50%  75%  max
col_1    3.0   4.0  3.0  1.0  2.5  4.0  5.5  7.0
col_2    3.0   5.0  3.0  2.0  3.5  5.0  6.5  8.0
col_3    3.0   6.0  3.0  3.0  4.5  6.0  7.5  9.0

In [11]:
df["col_1"]

first     1
second    4
third     7
Name: col_1, dtype: int64

In [12]:
type(df["col_1"])

pandas.core.series.Series

In [13]:
df[["col_1"]]

        col_1
first       1
second      4
third       7

#[] Series
#[[]] DataFrame

In [14]:
type(df[["col_1"]])

pandas.core.frame.DataFrame

In [15]:
df.columns = ["price_jan", "price_feb", "price_mar"]
df

        price_jan  price_feb  price_mar
first           1          2          3
second          4          5          6
third           7          8          9

In [16]:
df['total'] = df['price_jan'] + df['price_feb'] + df['price_mar']
df

        price_jan  price_feb  price_mar  total
first           1          2          3      6
second          4          5          6     15
third           7          8          9     24

In [17]:
df.loc['first']

price_jan    1
price_feb    2
price_mar    3
total        6
Name: first, dtype: int64

In [18]:
type(df.loc['first'])

pandas.core.series.Series

In [19]:
df.loc['second', 'total']

15

In [20]:
df.loc[:, 'total']

first      6
second    15
third     24
Name: total, dtype: int64

In [21]:
df.iloc[0]

price_jan    1
price_feb    2
price_mar    3
total        6
Name: first, dtype: int64

In [22]:
df.iloc[2,3]

24

#loc use names of index
#iloc use numbers of index